<a href="https://colab.research.google.com/github/Hadassa956/Hadassa956/blob/main/An%C3%A1lise_Financeira_ISP_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [40]:
import pandas as pd

In [41]:
car_df = pd.read_csv("cars.csv")

In [42]:
car_df.tail()

     Unnamed: 0   id  produto   saldo  UF  idade
995         995  296  celular  221.60  ES     39
996         996  195  celular  316.28  MG     36
997         997  271  celular  156.94  ES     45
998         998  104  celular  173.92  SP     42
999         999   92  celular  347.54  RJ     48

In [43]:
car_df.groupby("produto")['saldo'].mean()

produto
banda larga    176.501772
celular        231.490479
fibra          334.016847
Name: saldo, dtype: float64

In [44]:
car_df.groupby("produto")['saldo'].median()

produto
banda larga    175.11
celular        239.22
fibra          329.06
Name: saldo, dtype: float64

In [45]:
car_df.groupby("produto")['saldo'].sum()

produto
banda larga     58775.09
celular         77317.82
fibra          111227.61
Name: saldo, dtype: float64

Existe uma relação entre o produto e a dívida. Clientes que possuem fibra devem, em média, mais que os demais. A dívida total de fibra também é maior dentre o portifólio da empresa.

In [46]:
car_df.groupby("UF")['saldo'].sum()

UF
ES     40142.84
MG     47633.06
RJ     54224.29
SP    105320.33
Name: saldo, dtype: float64

Os estados com maior inadimplência SP e RJ, sendo SP com aproximadamente o dobro que RJ.

In [47]:
saldo_por_id = car_df.groupby("id")['saldo'].sum().reset_index()
top_10 = saldo_por_id.sort_values(by='saldo', ascending=False).head(10)

In [48]:
ids_top_10 = top_10.id.to_list()

In [49]:
car_df_top10 = car_df[car_df['id'].isin(ids_top_10)]
car_df_top10.groupby("id")['produto'].size()

id
20     3
52     3
82     3
103    3
132    3
183    3
292    3
311    3
377    3
398    3
Name: produto, dtype: int64